//==================== インポート ====================
using UnityEngine;
using System.Collections;

//==================== ビルボードクラス ====================
public class BillBoard : MonoBehaviour
{
	//******************** 定数宣言 ********************

	//******************** メンバ変数宣言 ********************
	//++++++++++ プライベート ++++++++++

	//++++++++++ プロテクト ++++++++++

	//++++++++++ パブリック ++++++++++
	public Camera	TargetCamera;						//ビルボード処理に使用する視点カメラ
	public bool		bControlVerticalFlag = true;		//縦方向回転制御フラグ

	//====================================================================================================
	//メソッド名	：Start
	//役割			：実行時に呼び出されるメソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Start()
	{
		//ビルボード処理に使用する視点カメラが指定されていない場合
		if(!(this.TargetCamera))
		{
			//メインカメラを視点カメラに指定する
			TargetCamera = Camera.mainCamera;
		}
	}

	//====================================================================================================
	//メソッド名	：Update
	//役割			：更新メソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Update()
	{
		//******************** 以下、カメラ視点方向指定 ********************
		//上下回転を制御する場合
		if(bControlVerticalFlag)
		{
			//******************** 変数宣言 ********************
			Vector3 Target = new Vector3(0.0f , 0.0f , 0.0f);		//ベクトル格納用

			//視点方向変更処理
			Target = this.TargetCamera.transform.position;	//カメラの方向を取得する
			Target.y = this.transform.position.y;			//y軸を直接指定
			this.transform.LookAt(Target);					//ターゲットにオブジェクトを向ける
		}
		//抑制しない場合
		else
		{
			//カメラの方向にオブジェクトを向かせる
			this.transform.LookAt(TargetCamera.transform.position);
		}
	}

	//====================================================================================================
	//メソッド名	：SetCamera
	//役割			：オブジェクトを向かせる対象となる視点カメラを設定する
	//引数			：(Camera PerspectiveCamera)		対象の視点カメラ
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	public void SetCamera(Camera PerspectiveCamera)
	{
		//対象のカメラを設定する
		TargetCamera = PerspectiveCamera;
	}

	//====================================================================================================
	//メソッド名	：SetControlVerticalFlag
	//役割			：オブジェクトを上下に回転させる制御用フラグの設定
	//引数			：(bool bControlFlag)		上下回転制御フラグ
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	public void SetControlVerticalFlag(bool bControlFlag)
	{
		//上下回転の制御フラグを設定する
		bControlVerticalFlag = bControlFlag;
	}
}
//================================================================================ EOF ================================================================================