//==================== インポート ====================
using UnityEngine;
using System.Collections;

//未使用変数警告を非表示に
#pragma warning disable 0414

//==================== モブクラス ====================
public class MOB : MonoBehaviour
{
	//******************** 定数宣言 ********************

	//******************** メンバ変数宣言 ********************
	//++++++++++ プライベート ++++++++++
	private SoundSpeaker	SoundSpeaker;		//自身が持つサウンドスピーカー
	private TextureScroll	ScrollDevice;		//自身が持つスクロールデバイス

	//++++++++++ プロテクト ++++++++++

	//++++++++++ パブリック ++++++++++ 

	//====================================================================================================
	//メソッド名	：Awake
	//役割			：コンストラクタ的な
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Awake()
	{
		//******************** 初期化処理 ********************
		//コンポーネント取得(デバイス生成)
		SoundSpeaker = this.GetComponent<SoundSpeaker>();	//サウンドスピーカー
		ScrollDevice = this.GetComponent<TextureScroll>();	//テスクチャスクロールデバイス

		//生成したこのMOBを、MOBManagerに格納する
		GameObject.Find("MOBManager").GetComponent<MOBManager>().SetMobAddress(this.name, -1);
	}

	//====================================================================================================
	//メソッド名	：Start
	//役割			：実行時に呼び出されるメソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Start()
	{
		
	}

	//====================================================================================================
	//メソッド名	：Update
	//役割			：更新メソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Update()
	{

	}
}
//================================================================================ EOF ================================================================================
