using UnityEngine;
using System.Collections;

//未使用変数警告を非表示に
#pragma warning disable 0414

public class OrderPlate : MonoBehaviour {
	//******************** 定数宣言 ********************

	//******************** メンバ変数宣言 ********************
	//++++++++++ プライベート ++++++++++
	private TextureScroll ScrollDevice;		//自身が持つスクロールデバイス

	//++++++++++ プロテクト ++++++++++

	//++++++++++ パブリック ++++++++++

	//====================================================================================================
	//メソッド名	：Awake
	//役割			：コンストラクタ的な
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Awake()
	{
		//******************** 初期化処理 ********************
		//コンポーネント取得(デバイス生成)
		ScrollDevice = this.GetComponent<TextureScroll>();		//テスクチャスクロールデバイス

		//生成した自身を、PlateManagerに格納する
		GameObject.Find("RankingPlateManager").GetComponent<ScorePlateManager>().SetOrderPlateAddress(this.name, -1);
	}

	//====================================================================================================
	//メソッド名	：Start
	//役割			：実行時に呼び出されるメソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Start()
	{

	}

	//====================================================================================================
	//メソッド名	：Update
	//役割			：更新メソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Update()
	{

	}
}
//================================================================================ EOF ================================================================================
