//==================== インポート ====================
using UnityEngine;
using System.Collections;
using System.IO;
using System;
using System.Text;
using CommonScore;

//==================== スコアファイル操作クラス ====================
public class ScoreFileOperation : MonoBehaviour
{
	//******************** 定数宣言 ********************

	//******************** メンバ変数宣言 ********************
	//++++++++++ プライベート ++++++++++

	//++++++++++ プロテクト ++++++++++

	//++++++++++ パブリック ++++++++++

	//====================================================================================================
	//メソッド名	：Awake
	//役割			：実行時に呼び出されるメソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Awake ()
	{
		
	}

	//====================================================================================================
	//メソッド名	：Start
	//役割			：実行時に呼び出されるメソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Start()
	{

	}

	//====================================================================================================
	//メソッド名	：Update
	//役割			：更新メソッド
	//引数			：void
	//戻り値		：void
	//作成者		：Nomura Syouhei
	//====================================================================================================
	void Update ()
	{
	
	}

	//====================================================================================================
	//メソッド名	：ScoreRead
	//役割			：今までのランキングを外部ファイルから取得する
	//引数			：void
	//戻り値		：(int[]型)		取得したランキングスコアの値
	//作成者		：Nomura Syouhei
	//====================================================================================================
	public int[] ScoreRead()
	{
		//******************** 変数宣言 ********************
		int nBuffer;				//int型バッファ
		int[] nRankingScore = null;	//ランキング格納用
		string sBuffer;				//String型バッファ
		FileStream FileDevice			= File.OpenRead(Application.dataPath + ConstantScore.RANKING_DATAPASS);		//
		StreamReader StreamReaderDevice	= new StreamReader(FileDevice, Encoding.UTF8);								//
		
		//******************** 初期化 ********************
		sBuffer				= StreamReaderDevice.ReadLine();		//ランキングに書き込まれている順位数を読み込む
		nBuffer				= int.Parse(sBuffer);					//読み込んだ順位数を整数型に変換する
		nRankingScore		= new int[nBuffer + 1];					//順位の数だけランキング格納用配列を生成
		nRankingScore[0]	= nBuffer;

		//読み込んだ順位の数だけループ
		for(int nLoop = 1; nLoop < nBuffer + 1 ; nLoop++)
		{
			try
			{
				//int型に変換したランキングの中身を格納する
				sBuffer = StreamReaderDevice.ReadLine();
				nRankingScore[nLoop] = int.Parse(sBuffer);
			}
			catch (Exception e)
			{
				//エラー出力
				Debug.Log("読込失敗");
			}
		}
		
		//取得したランキングを返却する
		return nRankingScore;
	}
}
//================================================================================ EOF ================================================================================
